ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F87J60_registers.h
#byte TOSU = 0xFFF

#byte TOSH = 0xFFE

#byte TOSL = 0xFFD

struct STKPTRBITS {
   unsigned int STKPTR0:1;
   unsigned int STKPTR1:1;
   unsigned int STKPTR2:1;
   unsigned int STKPTR3:1;
   unsigned int STKPTR4:1;
   unsigned int :1;
   unsigned int STKUNF:1;
   unsigned int STKFUL:1;
} STKPTRbits;
#byte STKPTRbits = 0xFFC
#byte STKPTR = 0xFFC

#byte PCLATU = 0xFFB

#byte PCLATH = 0xFFA

#byte PCL = 0xFF9

struct TBLPTRUBITS {
   unsigned int TBLPTRU0:1;
   unsigned int TBLPTRU1:1;
   unsigned int TBLPTRU2:1;
   unsigned int TBLPTRU3:1;
   unsigned int TBLPTRU4:1;
   unsigned int ACSS:1;
} TBLPTRUbits;
#byte TBLPTRUbits = 0xFF8
#byte TBLPTRU = 0xFF8

#byte TBLPTRH = 0xFF7

#byte TBLPTRL = 0xFF6

#byte TABLAT = 0xFF5

#byte PRODH = 0xFF4

#byte PRODL = 0xFF3

struct INTCONBITS {
   unsigned int RBIF:1;
   unsigned int INT0IF:1;
   unsigned int TMR0IF:1;
   unsigned int RBIE:1;
   unsigned int INT0IE:1;
   unsigned int TMR0IE:1;
   unsigned int PEIE_GIEL:1;
   unsigned int GIE_GIEH:1;
} INTCONbits;
#byte INTCONbits = 0xFF2
#byte INTCON = 0xFF2

struct INTCON2BITS {
   unsigned int RBIP:1;
   unsigned int INT3IP:1;
   unsigned int TMR0IP:1;
   unsigned int INTEDG3:1;
   unsigned int INTEDG4:1;
   unsigned int INTEDG5:1;
   unsigned int INTEDG6:1;
   unsigned int RBPU:1;
} INTCON2bits;
#byte INTCON2bits = 0xFF1
#byte INTCON2 = 0xFF1

struct INTCON3BITS {
   unsigned int INT1IF:1;
   unsigned int INT2IF:1;
   unsigned int INT3IF:1;
   unsigned int INT1IE:1;
   unsigned int INT2IE:1;
   unsigned int INT3IE:1;
   unsigned int INT1IP:1;
   unsigned int INT2IP:1;
} INTCON3bits;
#byte INTCON3bits = 0xFF0
#byte INTCON3 = 0xFF0

#byte INDF0 = 0xFEF

#byte POSTINC0 = 0xFEE

#byte POSTDEC0 = 0xFED

#byte PREINC0 = 0xFEC

#byte PLUSW0 = 0xFEB

#byte FSR0H = 0xFEA

#byte FSR0L = 0xFE9

#byte WREG = 0xFE8

#byte INDF1 = 0xFE7

#byte POSTINC1 = 0xFE6

#byte POSTDEC1 = 0xFE5

#byte PREINC1 = 0xFE4

#byte PLUSW1 = 0xFE3

#byte FSR1H = 0xFE2

#byte FSR1L = 0xFE1

#byte BSR = 0xFE0

#byte INDF2 = 0xFDF

#byte POSTINC2 = 0xFDE

#byte POSTDEC2 = 0xFDD

#byte PREINC2 = 0xFDC

#byte PLUSW2 = 0xFDB

#byte FSR2H = 0xFDA

#byte FSR2L = 0xFD9

#word FSR2 = 0xFD9

struct STATUSBITS {
   unsigned int C:1;
   unsigned int DC:1;
   unsigned int Z:1;
   unsigned int OV:1;
   unsigned int N:1;
} STATUSbits;
#byte STATUSbits = 0xFD8
#byte STATUS = 0xFD8

#byte TMR0H = 0xFD7

#byte TMR0L = 0xFD6

struct T0CONBITS {
   unsigned int T0PS0:1;
   unsigned int T0PS1:1;
   unsigned int T0PS2:1;
   unsigned int PSA:1;
   unsigned int T0SE:1;
   unsigned int T0CS:1;
   unsigned int T08BIT:1;
   unsigned int TMR0ON:1;
} T0CONbits;
#byte T0CONbits = 0xFD5
#byte T0CON = 0xFD5

struct OSCCONBITS {
   unsigned int SCS0:1;
   unsigned int SCS1:1;
   unsigned int :1;
   unsigned int OSTS:1;
   unsigned int :3;
   unsigned int IDLEN:1;
} OSCCONbits;
#byte OSCCONbits = 0xFD3
#byte OSCCON = 0xFD3

struct ECON1BITS {
   unsigned int :2;
   unsigned int RXEN:1;
   unsigned int TXRTS:1;
   unsigned int CSUMEN:1;
   unsigned int DMAST:1;
   unsigned int RXRST:1;
   unsigned int TXRST:1;
} ECON1bits;
#byte ECON1bits = 0xFD2
#byte ECON1 = 0xFD2

struct WDTCONBITS {
   unsigned int SWDTEN:1;
} WDTCONbits;
#byte WDTCONbits = 0xFD1
#byte WDTCON = 0xFD1

struct RCONBITS {
   unsigned int BOR:1;
   unsigned int POR:1;
   unsigned int PD:1;
   unsigned int TO:1;
   unsigned int RI:1;
   unsigned int :2;
   unsigned int IPEN:1;
} RCONbits;
#byte RCONbits = 0xFD0
#byte RCON = 0xFD0

#byte TMR1H = 0xFCF

#byte TMR1L = 0xFCE

struct T1CONBITS {
   unsigned int TMR1ON:1;
   unsigned int TMR1CS:1;
   unsigned int T1SYNC:1;
   unsigned int T1OSCEN:1;
   unsigned int T1CKPS4:1;
   unsigned int T1CKPS5:1;
   unsigned int T1RUN:1;
   unsigned int RD16:1;
} T1CONbits;
#byte T1CONbits = 0xFCD
#byte T1CON = 0xFCD

#byte TMR2 = 0xFCC

#byte PR2 = 0xFCB

struct T2CONBITS {
   unsigned int T2CKPS0:1;
   unsigned int T2CKPS1:1;
   unsigned int TMR2ON:1;
   unsigned int TOUTPS:4;
} T2CONbits;
#byte T2CONbits = 0xFCA
#byte T2CON = 0xFCA

#byte SSP1BUF = 0xFC9

#byte SSP1ADD = 0xFC8

struct SSP1STATBITS {
   unsigned int BF:1;
   unsigned int UA:1;
   unsigned int R:1;
   unsigned int S:1;
   unsigned int P:1;
   unsigned int D:1;
   unsigned int CKE:1;
   unsigned int SMP:1;
} SSP1STATbits;
#byte SSP1STATbits = 0xFC7
#byte SSP1STAT = 0xFC7

struct SSP1CON1BITS {
   unsigned int SSPM0:1;
   unsigned int SSPM1:1;
   unsigned int SSPM2:1;
   unsigned int SSPM3:1;
   unsigned int CKP:1;
   unsigned int SSPEN:1;
   unsigned int SSPOV:1;
   unsigned int WCOL:1;
} SSP1CON1bits;
#byte SSP1CON1bits = 0xFC6
#byte SSP1CON1 = 0xFC6

struct SSP1CON2BITS {
   unsigned int SEN:1;
   unsigned int RSEN:1;
   unsigned int PEN:1;
   unsigned int RCEN:1;
   unsigned int ACKEN:1;
   unsigned int ACKDT:1;
   unsigned int ACKSTAT:1;
   unsigned int GCEN:1;
} SSP1CON2bits;
#byte SSP1CON2bits = 0xFC5
#byte SSP1CON2 = 0xFC5

#byte ADRESH = 0xFC4

#byte ADRESL = 0xFC3

struct ADCON0BITS {
   unsigned int ADON:1;
   unsigned int GO:1;
   unsigned int CHS:4;
} ADCON0bits;
#byte ADCON0bits = 0xFC2
#byte ADCON0 = 0xFC2

struct ADCON1BITS {
   unsigned int PCFG0:1;
   unsigned int PCFG1:1;
   unsigned int PCFG2:1;
   unsigned int PCFG3:1;
   unsigned int VCFG4:1;
   unsigned int VCFG1:1;
} ADCON1bits;
#byte ADCON1bits = 0xFC1
#byte ADCON1 = 0xFC1

struct ADCON2BITS {
   unsigned int ADCS0:1;
   unsigned int ADCS1:1;
   unsigned int ADCS2:1;
   unsigned int ACQT3:1;
   unsigned int ACQT4:1;
   unsigned int ACQT2:1;
   unsigned int :1;
   unsigned int ADFM:1;
} ADCON2bits;
#byte ADCON2bits = 0xFC0
#byte ADCON2 = 0xFC0

#byte CCPR1H = 0xFBF

#byte CCPR1L = 0xFBE

struct CCP1CONBITS {
   unsigned int CCP1M0:1;
   unsigned int CCP1M1:1;
   unsigned int CCP1M2:1;
   unsigned int CCP1M3:1;
   unsigned int DC1B4:1;
   unsigned int DC1B5:1;
   unsigned int P1M6:1;
   unsigned int P1M1:1;
} CCP1CONbits;
#byte CCP1CONbits = 0xFBD
#byte CCP1CON = 0xFBD

#byte CCPR2H = 0xFBC

#byte CCPR2L = 0xFBB

struct CCP2CONBITS {
   unsigned int CCP2M0:1;
   unsigned int CCP2M1:1;
   unsigned int CCP2M2:1;
   unsigned int CCP2M3:1;
   unsigned int DC2B4:1;
   unsigned int DC2B5:1;
   unsigned int P2M6:1;
   unsigned int P2M1:1;
} CCP2CONbits;
#byte CCP2CONbits = 0xFBA
#byte CCP2CON = 0xFBA

#byte CCPR3H = 0xFB9

#byte CCPR3L = 0xFB8

struct CCP3CONBITS {
   unsigned int CCP3M0:1;
   unsigned int CCP3M1:1;
   unsigned int CCP3M2:1;
   unsigned int CCP3M3:1;
   unsigned int DC3B4:1;
   unsigned int DC3B5:1;
   unsigned int P3M6:1;
   unsigned int P3M1:1;
} CCP3CONbits;
#byte CCP3CONbits = 0xFB7
#byte CCP3CON = 0xFB7

struct ECCP1ASBITS {
   unsigned int PSSBD0:1;
   unsigned int PSSBD1:1;
   unsigned int PSSAC2:1;
   unsigned int PSSAC3:1;
   unsigned int ECCPAS4:1;
   unsigned int ECCPAS5:1;
   unsigned int ECCPAS6:1;
   unsigned int ECCPASE:1;
} ECCP1ASbits;
#byte ECCP1ASbits = 0xFB6
#byte ECCP1AS = 0xFB6

