ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F87J60_registers.h
struct CVRCONBITS {
   unsigned int CVR0:1;
   unsigned int CVR1:1;
   unsigned int CVR2:1;
   unsigned int CVR3:1;
   unsigned int CVRSS:1;
   unsigned int CVRR:1;
   unsigned int CVROE:1;
   unsigned int CVREN:1;
} CVRCONbits;
#byte CVRCONbits = 0xFB5
#byte CVRCON = 0xFB5

struct CMCONBITS {
   unsigned int CM0:1;
   unsigned int CM1:1;
   unsigned int CM2:1;
   unsigned int CIS:1;
   unsigned int C1INV:1;
   unsigned int C2INV:1;
   unsigned int C1OUT:1;
   unsigned int C2OUT:1;
} CMCONbits;
#byte CMCONbits = 0xFB4
#byte CMCON = 0xFB4

#byte TMR3H = 0xFB3

#byte TMR3L = 0xFB2

struct T3CONBITS {
   unsigned int TMR3ON:1;
   unsigned int TMR3CS:1;
   unsigned int T3SYNC:1;
   unsigned int T3CCP3:1;
   unsigned int T3CKPS4:1;
   unsigned int T3CKPS5:1;
   unsigned int T3CCP6:1;
   unsigned int RD16:1;
} T3CONbits;
#byte T3CONbits = 0xFB1
#byte T3CON = 0xFB1

#byte SPBRG1 = 0xFAF

#byte RCREG1 = 0xFAE

#byte TXREG1 = 0xFAD

struct TXSTA1BITS {
   unsigned int TX9D:1;
   unsigned int TRMT:1;
   unsigned int BRGH:1;
   unsigned int SENDB:1;
   unsigned int SYNC:1;
   unsigned int TXEN:1;
   unsigned int TX:1;
   unsigned int CSRC:1;
} TXSTA1bits;
#byte TXSTA1bits = 0xFAC
#byte TXSTA1 = 0xFAC

struct RCSTA1BITS {
   unsigned int RX9D:1;
   unsigned int OERR:1;
   unsigned int FERR:1;
   unsigned int ADDEN:1;
   unsigned int CREN:1;
   unsigned int SREN:1;
   unsigned int RX:1;
   unsigned int SPEN:1;
} RCSTA1bits;
#byte RCSTA1bits = 0xFAB
#byte RCSTA1 = 0xFAB

#byte EECON2 = 0xFA7

struct EECON1BITS {
   unsigned int :1;
   unsigned int WR:1;
   unsigned int WREN:1;
   unsigned int WRERR:1;
   unsigned int FREE:1;
} EECON1bits;
#byte EECON1bits = 0xFA6
#byte EECON1 = 0xFA6

struct IPR3BITS {
   unsigned int CCP3IP:1;
   unsigned int CCP4IP:1;
   unsigned int CCP5IP:1;
   unsigned int TMR4IP:1;
   unsigned int TX2IP:1;
   unsigned int RC2IP:1;
} IPR3bits;
#byte IPR3bits = 0xFA5
#byte IPR3 = 0xFA5

struct PIR3BITS {
   unsigned int CCP3IF:1;
   unsigned int CCP4IF:1;
   unsigned int CCP5IF:1;
   unsigned int TMR4IF:1;
   unsigned int TX2IF:1;
   unsigned int RC2IF:1;
} PIR3bits;
#byte PIR3bits = 0xFA4
#byte PIR3 = 0xFA4

struct PIE3BITS {
   unsigned int CCP3IE:1;
   unsigned int CCP4IE:1;
   unsigned int CCP5IE:1;
   unsigned int TMR4IE:1;
   unsigned int TX2IE:1;
   unsigned int RC2IE:1;
} PIE3bits;
#byte PIE3bits = 0xFA3
#byte PIE3 = 0xFA3

struct IPR2BITS {
   unsigned int CCP2IP:1;
   unsigned int TMR3IP:1;
   unsigned int :1;
   unsigned int BCL1IP:1;
   unsigned int WOLIP:1;
   unsigned int ETHIP:1;
   unsigned int CMIP:1;
   unsigned int OSCFIP:1;
} IPR2bits;
#byte IPR2bits = 0xFA2
#byte IPR2 = 0xFA2

struct PIR2BITS {
   unsigned int CCP2IF:1;
   unsigned int TMR3IF:1;
   unsigned int :1;
   unsigned int BCL1IF:1;
   unsigned int WOLIF:1;
   unsigned int ETHIF:1;
   unsigned int CMIF:1;
   unsigned int OSCFIF:1;
} PIR2bits;
#byte PIR2bits = 0xFA1
#byte PIR2 = 0xFA1

struct PIE2BITS {
   unsigned int CCP2IE:1;
   unsigned int TMR3IE:1;
   unsigned int :1;
   unsigned int BCL1IE:1;
   unsigned int WOLIE:1;
   unsigned int ETHIE:1;
   unsigned int CMIE:1;
   unsigned int OSCFIE:1;
} PIE2bits;
#byte PIE2bits = 0xFA0
#byte PIE2 = 0xFA0

struct IPR1BITS {
   unsigned int TMR1IP:1;
   unsigned int TMR2IP:1;
   unsigned int CCP1IP:1;
   unsigned int SSP1IP:1;
   unsigned int TX1IP:1;
   unsigned int RC1IP:1;
   unsigned int ADIP:1;
} IPR1bits;
#byte IPR1bits = 0xF9F
#byte IPR1 = 0xF9F

struct PIR1BITS {
   unsigned int TMR1IF:1;
   unsigned int TMR2IF:1;
   unsigned int CCP1IF:1;
   unsigned int SSP1IF:1;
   unsigned int TX1IF:1;
   unsigned int RC1IF:1;
   unsigned int ADIF:1;
} PIR1bits;
#byte PIR1bits = 0xF9E
#byte PIR1 = 0xF9E

struct PIE1BITS {
   unsigned int TMR1IE:1;
   unsigned int TMR2IE:1;
   unsigned int CCP1IE:1;
   unsigned int SSP1IE:1;
   unsigned int TX1IE:1;
   unsigned int RC1IE:1;
   unsigned int ADIE:1;
} PIE1bits;
#byte PIE1bits = 0xF9D
#byte PIE1 = 0xF9D

struct OSCTUNEBITS {
   unsigned int :4;
   unsigned int PPRE:1;
   unsigned int PPST5:1;
   unsigned int PLLEN:1;
   unsigned int PPST1:1;
} OSCTUNEbits;
#byte OSCTUNEbits = 0xF9B
#byte OSCTUNE = 0xF9B

struct TRISJBITS {
   unsigned int :4;
   unsigned int TRISJ4:1;
   unsigned int TRISJ5:1;
} TRISJbits;
#byte TRISJbits = 0xF9A
#byte TRISJ = 0xF9A

struct TRISHBITS {
   unsigned int TRISH0:1;
   unsigned int TRISH1:1;
   unsigned int TRISH2:1;
   unsigned int TRISH3:1;
   unsigned int TRISH4:1;
   unsigned int TRISH5:1;
   unsigned int TRISH6:1;
   unsigned int TRISH7:1;
} TRISHbits;
#byte TRISHbits = 0xF99
#byte TRISH = 0xF99

struct TRISGBITS {
   unsigned int TRISG0:1;
   unsigned int TRISG1:1;
   unsigned int TRISG2:1;
   unsigned int TRISG3:1;
   unsigned int TRISG4:1;
   unsigned int TRISG5:1;
   unsigned int TRISG6:1;
   unsigned int TRISG7:1;
} TRISGbits;
#byte TRISGbits = 0xF98
#byte TRISG = 0xF98

struct TRISFBITS {
   unsigned int :1;
   unsigned int TRISF1:1;
   unsigned int TRISF2:1;
   unsigned int TRISF3:1;
   unsigned int TRISF4:1;
   unsigned int TRISF5:1;
   unsigned int TRISF6:1;
   unsigned int TRISF7:1;
} TRISFbits;
#byte TRISFbits = 0xF97
#byte TRISF = 0xF97

struct TRISEBITS {
   unsigned int TRISE0:1;
   unsigned int TRISE1:1;
   unsigned int TRISE2:1;
   unsigned int TRISE3:1;
   unsigned int TRISE4:1;
   unsigned int TRISE5:1;
   unsigned int TRISE6:1;
   unsigned int TRISE7:1;
} TRISEbits;
#byte TRISEbits = 0xF96
#byte TRISE = 0xF96

struct TRISDBITS {
   unsigned int TRISD0:1;
   unsigned int TRISD1:1;
   unsigned int TRISD2:1;
   unsigned int TRISD3:1;
   unsigned int TRISD4:1;
   unsigned int TRISD5:1;
   unsigned int TRISD6:1;
   unsigned int TRISD7:1;
} TRISDbits;
#byte TRISDbits = 0xF95
#byte TRISD = 0xF95

struct TRISCBITS {
   unsigned int TRISC0:1;
   unsigned int TRISC1:1;
   unsigned int TRISC2:1;
   unsigned int TRISC3:1;
   unsigned int TRISC4:1;
   unsigned int TRISC5:1;
   unsigned int TRISC6:1;
   unsigned int TRISC7:1;
} TRISCbits;
#byte TRISCbits = 0xF94
#byte TRISC = 0xF94

struct TRISBBITS {
   unsigned int TRISB0:1;
   unsigned int TRISB1:1;
   unsigned int TRISB2:1;
   unsigned int TRISB3:1;
   unsigned int TRISB4:1;
   unsigned int TRISB5:1;
   unsigned int TRISB6:1;
   unsigned int TRISB7:1;
} TRISBbits;
#byte TRISBbits = 0xF93
#byte TRISB = 0xF93

