ammarRajabA/ENC28J60-LAN/CCS_5 C code/TCPIP/PIC18F87J60_registers.h
struct TRISABITS {
   unsigned int TRISA0:1;
   unsigned int TRISA1:1;
   unsigned int TRISA2:1;
   unsigned int TRISA3:1;
   unsigned int TRISA4:1;
   unsigned int TRISA5:1;
   unsigned int TRISA6:1;
   unsigned int TRISA7:1;
} TRISAbits;
#byte TRISAbits = 0xF92
#byte TRISA = 0xF92

struct LATJBITS {
   unsigned int :4;
   unsigned int LATJ4:1;
   unsigned int LATJ5:1;
} LATJbits;
#byte LATJbits = 0xF91
#byte LATJ = 0xF91

struct LATHBITS {
   unsigned int LATH0:1;
   unsigned int LATH1:1;
   unsigned int LATH2:1;
   unsigned int LATH3:1;
   unsigned int LATH4:1;
   unsigned int LATH5:1;
   unsigned int LATH6:1;
   unsigned int LATH7:1;
} LATHbits;
#byte LATHbits = 0xF90
#byte LATH = 0xF90

struct LATGBITS {
   unsigned int LATG0:1;
   unsigned int LATG1:1;
   unsigned int LATG2:1;
   unsigned int LATG3:1;
   unsigned int LATG4:1;
   unsigned int LATG5:1;
   unsigned int LATG6:1;
   unsigned int LATG7:1;
} LATGbits;
#byte LATGbits = 0xF8F
#byte LATG = 0xF8F

struct LATFBITS {
   unsigned int :1;
   unsigned int LATF1:1;
   unsigned int LATF2:1;
   unsigned int LATF3:1;
   unsigned int LATF4:1;
   unsigned int LATF5:1;
   unsigned int LATF6:1;
   unsigned int LATF7:1;
} LATFbits;
#byte LATFbits = 0xF8E
#byte LATF = 0xF8E

struct LATEBITS {
   unsigned int LATE0:1;
   unsigned int LATE1:1;
   unsigned int LATE2:1;
   unsigned int LATE3:1;
   unsigned int LATE4:1;
   unsigned int LATE5:1;
   unsigned int LATE6:1;
   unsigned int LATE7:1;
} LATEbits;
#byte LATEbits = 0xF8D
#byte LATE = 0xF8D

struct LATDBITS {
   unsigned int LATD0:1;
   unsigned int LATD1:1;
   unsigned int LATD2:1;
   unsigned int LATD3:1;
   unsigned int LATD4:1;
   unsigned int LATD5:1;
   unsigned int LATD6:1;
   unsigned int LATD7:1;
} LATDbits;
#byte LATDbits = 0xF8C
#byte LATD = 0xF8C

struct LATCBITS {
   unsigned int LATC0:1;
   unsigned int LATC1:1;
   unsigned int LATC2:1;
   unsigned int LATC3:1;
   unsigned int LATC4:1;
   unsigned int LATC5:1;
   unsigned int LATC6:1;
   unsigned int LATC7:1;
} LATCbits;
#byte LATCbits = 0xF8B
#byte LATC = 0xF8B

struct LATBBITS {
   unsigned int LATB0:1;
   unsigned int LATB1:1;
   unsigned int LATB2:1;
   unsigned int LATB3:1;
   unsigned int LATB4:1;
   unsigned int LATB5:1;
   unsigned int LATB6:1;
   unsigned int LATB7:1;
} LATBbits;
#byte LATBbits = 0xF8A
#byte LATB = 0xF8A

struct LATABITS {
   unsigned int LATA0:1;
   unsigned int LATA1:1;
   unsigned int LATA2:1;
   unsigned int LATA3:1;
   unsigned int LATA4:1;
   unsigned int LATA5:1;
   unsigned int REPU:1;
   unsigned int RDPU:1;
} LATAbits;
#byte LATAbits = 0xF89
#byte LATA = 0xF89

struct PORTJBITS {
   unsigned int :4;
   unsigned int RJ4:1;
   unsigned int RJ5:1;
} PORTJbits;
#byte PORTJbits = 0xF88
#byte PORTJ = 0xF88

struct PORTHBITS {
   unsigned int RH0:1;
   unsigned int RH1:1;
   unsigned int RH2:1;
   unsigned int RH3:1;
   unsigned int RH4:1;
   unsigned int RH5:1;
   unsigned int RH6:1;
   unsigned int RH7:1;
} PORTHbits;
#byte PORTHbits = 0xF87
#byte PORTH = 0xF87

struct PORTGBITS {
   unsigned int RG0:1;
   unsigned int RG1:1;
   unsigned int RG2:1;
   unsigned int RG3:1;
   unsigned int RG4:1;
   unsigned int RG5:1;
   unsigned int RG6:1;
   unsigned int RG7:1;
} PORTGbits;
#byte PORTGbits = 0xF86
#byte PORTG = 0xF86

struct PORTFBITS {
   unsigned int :1;
   unsigned int RF1:1;
   unsigned int RF2:1;
   unsigned int RF3:1;
   unsigned int RF4:1;
   unsigned int RF5:1;
   unsigned int RF6:1;
   unsigned int RF7:1;
} PORTFbits;
#byte PORTFbits = 0xF85
#byte PORTF = 0xF85

struct PORTEBITS {
   unsigned int RE0:1;
   unsigned int RE1:1;
   unsigned int RE2:1;
   unsigned int RE3:1;
   unsigned int RE4:1;
   unsigned int RE5:1;
   unsigned int RE6:1;
   unsigned int RE7:1;
} PORTEbits;
#byte PORTEbits = 0xF84
#byte PORTE = 0xF84

struct PORTDBITS {
   unsigned int RD0:1;
   unsigned int RD1:1;
   unsigned int RD2:1;
   unsigned int RD3:1;
   unsigned int RD4:1;
   unsigned int RD5:1;
   unsigned int RD6:1;
   unsigned int RD7:1;
} PORTDbits;
#byte PORTDbits = 0xF83
#byte PORTD = 0xF83

struct PORTCBITS {
   unsigned int RC0:1;
   unsigned int RC1:1;
   unsigned int RC2:1;
   unsigned int RC3:1;
   unsigned int RC4:1;
   unsigned int RC5:1;
   unsigned int RC6:1;
   unsigned int RC7:1;
} PORTCbits;
#byte PORTCbits = 0xF82
#byte PORTC = 0xF82

struct PORTBBITS {
   unsigned int RB0:1;
   unsigned int RB1:1;
   unsigned int RB2:1;
   unsigned int RB3:1;
   unsigned int RB4:1;
   unsigned int RB5:1;
   unsigned int RB6:1;
   unsigned int RB7:1;
} PORTBbits;
#byte PORTBbits = 0xF81
#byte PORTB = 0xF81

struct PORTABITS {
   unsigned int RA0:1;
   unsigned int RA1:1;
   unsigned int RA2:1;
   unsigned int RA3:1;
   unsigned int RA4:1;
   unsigned int RA5:1;
   unsigned int :1;
   unsigned int RJPU:1;
} PORTAbits;
#byte PORTAbits = 0xF80
#byte PORTA = 0xF80

#byte SPBRGH1 = 0xF7F

struct BAUDCON1BITS {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG1:1;
   unsigned int TXCKP:1;
   unsigned int RXDTP:1;
   unsigned int RCIDL:1;
   unsigned int ABDOVF:1;
} BAUDCON1bits;
#byte BAUDCON1bits = 0xF7E
#byte BAUDCON1 = 0xF7E

#byte SPBRGH2 = 0xF7D

struct BAUDCON2BITS {
   unsigned int ABDEN:1;
   unsigned int WUE:1;
   unsigned int :1;
   unsigned int BRG1:1;
   unsigned int TXCKP:1;
   unsigned int RXDTP:1;
   unsigned int RCIDL:1;
   unsigned int ABDOVF:1;
} BAUDCON2bits;
#byte BAUDCON2bits = 0xF7C
#byte BAUDCON2 = 0xF7C

#byte ERDPTH = 0xF7B

#byte ERDPTL = 0xF7A

#word ERDPT = 0xF7A

struct ECCP1DELBITS {
   unsigned int PDC0:1;
   unsigned int PDC1:1;
   unsigned int PDC2:1;
   unsigned int PDC3:1;
   unsigned int PDC4:1;
   unsigned int PDC5:1;
   unsigned int PDC6:1;
   unsigned int PRSEN:1;
} ECCP1DELbits;
#byte ECCP1DELbits = 0xF79
#byte ECCP1DEL = 0xF79

